/**
 * Created with IntelliJ IDEA.
 * User: Cory
 * Date: 3/2/14
 * Time: 6:44 PM
 * To change this template use File | Settings | File Templates.
 */

"use strict";

module.exports = function () {
    return {
        text: function () {
            return {
                pre: "大家好，很高兴认识大家！给大家简单介绍一下！照片里笑的憨厚可亲的人呢就是我---姚琳（山西运城临猗人），大家还是叫我姚姐(愣愣就这么叫)吧~~~我的性格属于内外兼并型，优点是沉静、稳重带点可亲，缺点则是倔强且缺乏毅力，爱好到目前为止没有特别喜欢也没有特别讨厌的。目前就职于太原同方知网，主要工作是期刊标引。在2010.11上大学的第一个学期认识了师超鹏童鞋，一路走来相遇；相识；相恨；相知；相爱，我感到无比的幸运+幸福，幸运是因为遇到了他，幸福也是因为遇到了他，我相信我们一直会幸福下去的，也希望每一个人幸福永相随。--(2015-03-25)",
                one: "Hi!我叫师超鹏(户口山西孝义人，今住山西介休)。目前为止还没有超鹏。目前还是北漂一族，就职于北京一互联网创业公司，老老实实的做了1年多软件开发，正在努力学习各种技术(你现在看的网站就是nodejs技术栈的结果)，郑重声明我不是修电脑的（就像范冰冰是拍电视的而不是修电视的）。向往自由！喜欢有文艺性质的事物，热衷于技术。但在一切事情中，家庭和谐永远排在第一位，编程并列第一位！活了20多年，最幸运的是能够认识@姚琳 同学，而最大的幸福是能够和她一起去走未来的第一、第二个甚至第三个20年. 时光清浅，请容我陪你一起老。   (: --(2015-03-25)",
                two: "春风，划过美好的春天，洗涤岁月的尘埃，湿润了一份心境，给人留下一抹清凉。春风捻着往事，在岁月素白的笺上暗香盈袖。进入大学认识了姚琳，一个系不是一个班，中途有很多波折(主要原因在我)。比较深刻的记忆是一起在苏州的那段时间，大热天坐在自动饮料机跟前一瓶一瓶的喝饮料，还有那杯坑爹的西瓜汁。大三和她正式在一起，过上正常的情侣生活压马路，吵架(很多人应该都知道)，最后....(发挥你们想象力)。毕业之后在太原工作了小半年，一起在小王村居住，那会刚毕业无忧无虑。中途去运城创业，创业非常失败，她赚钱养活了我几个月，那几个月和她过的非常愉快(如果有机会，会到运城养老)，中间她去相过一次亲(经历非常逗)，那年见了她父母(非常不理想)，相信坚持就是胜利，所以两人还是愉快的在一起了。--(2015-03-27)",
                three: "走过流年的岁月，总会有一处风景，为我们而绽放；总会有一个人知你冷暖，懂你悲欢；爱如手中沙，抓太紧反而会从指缝间流失；情如是水中月，试图捞起反而愈觉虚幻；想一个人，就是把水变成泪；爱一个人，就是把泪变成血。你的梦里有她，她的梦里有你，常在梦里相聚，心里便幸福美满。即使独处，即使感觉所有的人都背叛了你，世界上只剩下你一个人，不会感到寂寞和孤单。因为总有一颗心与你在一起，有一双眼默默注视着你，为你祝福。风雨时，他会在你心头撑一把伞；黑暗时，他会在你心里点一盏灯；难过时，他会不厌其烦安慰你；哭泣时，他会给你一个胸怀；累时，他会把肩膀凑过来。他在的时候，你会感到温暖，体会到深深的爱意。他不在时，你会为他牵挂。 --(2015-04-01) ",
                four: "欢迎你们来参加我们的婚礼，感谢与你们相遇，让时光多了一份感动；感谢与你们相知，让生活多了一份温暖；感谢与你们一起的经历，让流年多了一份生动；"
            };
        },
        title: function() {
            return {
                pre: "She grows up...",
                one: "He grows up...",
                two: "They grow up...",
                three: "He proposes...",
                four: "They marry, we celebrate..."
            };
        }
    };
};